lvx/extension/Documents/ЭтапПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_Напечатано</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_СерииСгенерированы</Name>
					<Comment>ЛТ 6.7</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_ГруппировкиПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АгрегированнаяНоменклатура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СигнатураСостава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распечатано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>бит_СоставГруппировокПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/extension/Documents/ЭтапПроизводства2_2/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)

	Если ВыполняетсяПакетноеФормирование() Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗаполнения = ПараметрыЗаполненияВидовЗапасов("Проведение");
	ДополнительныеСвойства.Вставить("ПараметрыЗаполненияВидовЗапасов", ПараметрыЗаполнения);
	ДополнительныеСвойства.Вставить("ИспользоватьПриПодготовкеПараметрыЗаполненияВидовЗапасов");

	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ДополнительныеСвойства = ДополнительныеСвойства;

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры); 
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [ЛТ6.15]  [VUVaynula@1cbit.ru] [29.06.2026 13:29:58] +        
	Если Не Отказ Тогда
		бит_ЗаписатьДвиженияЦепочкиНазначений();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.15]  [VUVaynula@1cbit.ru] [29.06.2026 13:29:58] -
	#КонецВставки

	ВыполнитьКонтрольПриЗакрытииЭтапа(Отказ);

	ОбновитьСвязанныеДанные(Отказ);

	Если Не Отказ И ЗначениеЗаполнено(ДополнительныеСвойства.ПериодПерезаписиДвижений) Тогда
		РегистрыСведений.ЗаданияКРасчетуСебестоимости.СоздатьЗаписьРегистра(
		ДополнительныеСвойства.ПериодПерезаписиДвижений,
		Ссылка,
		Организация);
	КонецЕсли;

	ЭтапПроизводства2_2Локализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры

Процедура бит_ЗаписатьДвиженияЦепочкиНазначений()
	// {{ПервыйБИТ ЛистТребований [ЛТ6.15]  [VUVaynula@1cbit.ru] [29.06.2026 13:30:21] +        
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Характеристика КАК Характеристика,
	                      |	ЭтапПроизводства2_2.Ссылка КАК Этап,
	                      |	ЭтапПроизводства2_2.Распоряжение КАК ЗаказНаПроизводство,
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение
	                      |ПОМЕСТИТЬ База
	                      |ИЗ
	                      |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	                      |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ЭтапПроизводства2_2.Ссылка
	                      |ГДЕ
	                      |	ЭтапПроизводства2_2.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	База.Этап КАК Этап,
	                      |	База.Назначение КАК Назначение,
	                      |	База.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	                      |	База.Назначение.Заказ КАК ЗаказНазначения,
	                      |	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
	                      |	ЗаказНаПроизводство2_2Продукция.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ втКлючиЗаказовКлиентов
	                      |ИЗ
	                      |	База КАК База
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	                      |		ПО (ЗаказНаПроизводство2_2Продукция.Ссылка = База.ЗаказНаПроизводство)
	                      |			И (ЗаказНаПроизводство2_2Продукция.Назначение = База.Назначение)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	втКлючиЗаказовКлиентов.Этап КАК Этап,
	                      |	втКлючиЗаказовКлиентов.ЗаказНазначения КАК Заказ0,
	                      |	ТоварыЗаказаНаПеремещение1.Назначение.Заказ КАК Заказ1,
	                      |	ТоварыЗаказаНаПеремещение2.Назначение.Заказ КАК Заказ2
	                      |ПОМЕСТИТЬ втРазборЗаказовКлиентов
	                      |ИЗ
	                      |	втКлючиЗаказовКлиентов КАК втКлючиЗаказовКлиентов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыЗаказаНаПеремещение1
	                      |		ПО (ТоварыЗаказаНаПеремещение1.Ссылка = (ВЫРАЗИТЬ(втКлючиЗаказовКлиентов.ЗаказНазначения КАК Документ.ЗаказНаПеремещение)))
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыЗаказаНаПеремещение2
	                      |		ПО (ТоварыЗаказаНаПеремещение2.Ссылка = (ВЫРАЗИТЬ(ТоварыЗаказаНаПеремещение1.Назначение.Заказ КАК Документ.ЗаказНаПеремещение)))
	                      |			И (ТоварыЗаказаНаПеремещение2.Номенклатура = втКлючиЗаказовКлиентов.Номенклатура)
	                      |			И (ТоварыЗаказаНаПеремещение2.Характеристика = втКлючиЗаказовКлиентов.Характеристика)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	втРазборЗаказовКлиентов.Этап КАК Этап,
	                      |	ВЫБОР
	                      |		КОГДА втРазборЗаказовКлиентов.Заказ0 ССЫЛКА Документ.ЗаказКлиента
	                      |			ТОГДА ВЫРАЗИТЬ(втРазборЗаказовКлиентов.Заказ0 КАК Документ.ЗаказКлиента)
	                      |		КОГДА втРазборЗаказовКлиентов.Заказ1 ССЫЛКА Документ.ЗаказКлиента
	                      |			ТОГДА ВЫРАЗИТЬ(втРазборЗаказовКлиентов.Заказ1 КАК Документ.ЗаказКлиента)
	                      |		КОГДА втРазборЗаказовКлиентов.Заказ2 ССЫЛКА Документ.ЗаказКлиента
	                      |			ТОГДА ВЫРАЗИТЬ(втРазборЗаказовКлиентов.Заказ2 КАК Документ.ЗаказКлиента)
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	                      |	КОНЕЦ КАК ЗаказКлиента
	                      |ПОМЕСТИТЬ втЗаказыКлиентов
	                      |ИЗ
	                      |	втРазборЗаказовКлиентов КАК втРазборЗаказовКлиентов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	База.Номенклатура КАК Номенклатура,
	                      |	База.Характеристика КАК Характеристика,
	                      |	База.Этап КАК ЭтапПроизводства,
	                      |	База.Этап КАК Регистратор,
	                      |	втЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
	                      |	втРазборЗаказовКлиентов.Заказ0 КАК ЗаказНаПеремещениеФабрика_РЦ,
	                      |	втРазборЗаказовКлиентов.Заказ1 КАК ЗаказНаПеремещениеРЦ_Магазин
	                      |ИЗ
	                      |	База КАК База
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказыКлиентов КАК втЗаказыКлиентов
	                      |		ПО База.Этап = втЗаказыКлиентов.Этап
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втРазборЗаказовКлиентов КАК втРазборЗаказовКлиентов
	                      |		ПО (втРазборЗаказовКлиентов.Этап = База.Этап)"); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.бит_ЦепочкаНазначенийЭтапаПроизводства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Загрузить(Результат);
	НаборЗаписей.Записать(Истина);
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.15]  [VUVaynula@1cbit.ru] [29.06.2026 13:30:21] -
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [08.07.2026 19:03:54] +        
	Если ЗначениеЗаполнено(Этап) Тогда
		бит_ПечатьПаспорта = Этап.бит_ПечатьПаспорта;	
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ6.10]  [VUVaynula@1cbit.ru] [08.07.2026 19:03:54] -
КонецПроцедуры
